import random
import os
name = "" ###Ваше имя
live = 100 ###Жизнь
happy = 100 ###Желание жить
hostal = 'Бездомный' ###Дом
car = 'Велосипед' ###Машина
lavl = 0 ##Уровень игрока
eat = 70 ###Голод
sleep = 100 ###Сон
Time = 9 ###Время - день\ночь
day = 1 ###Какой сейчас день
money = 14400000 ###Деньги
go = None ###Действие
p = '\n'
holodos = [('Буханка хлеба','25','руб','20'),('Колбаса','150','руб','60')] ###Холодильник
perehod = None ###Вспомогательная переменная действия
magaz = [('Буханка хлеба','25','руб','20'),('Колбаса','150','руб','60'),('Молоко','40','руб','35'),
('Бич-пакет','15','руб','10'),('Огурцы','20','руб/кг','15'),('Помидоры','35','руб/кг','25'),
('Сыр','120','руб','50'),('Пельмени','150','руб','70'),('Макароны','60','руб','45'),
('Тушёнка','70','руб','50'),('Кофе','50','руб','20'),('Чай','15','руб','10')] ###Магазин
kost = 0 ###Счётчик int
i = None ###Счётчик

mass = [r'''

░░░░░░░░░░░░░░░▄▄▄▄▄▄▄▄░░░░░░░░░░░░░░░░░
░░░░░░░░░▄▄█████████████▄░░░░░░░░░░░░░░░
░░░░░░░▄██████████████████░░░░░░░░░░░░░░
░░░░░▄██████████████▀▀▀░▀██░░░░░░░░░░░░░
░░░░▄██████▀▀▀▀▀▀░░░░░░░░▀██░░░░░░░░░░░░
░░░░████████░░░░░░░░░░░░░░▀█░░░░░░░░░░░░
░░░░████████░░░░░░░░░░░░░░▄█▄░░░░░░░░░░░
░░░░████████░░░░░░░░░░▄░░███▀░░░░░░░░░░░
░░░░░██████░░░░░█▀███▀▀░░░░░░░░░░░░░░░░░
░░░░░███████░░░░░▀▀▀░░░░░░░░░░░░░░░░░░░░
░░░░░▀█░░▀██░░░░░░░░░░▄░░░░▀░░░░░░░░░░░░
░░░░░░▀▄░░▄▀░░░░░░░░░░░▄████▀░░░░░░░░░░░
░░░░░░░░░░░░▄░░░░░░░░██▀█▄██░░░░░░░░░░░░
░░░░░░░░░░░▀░░░░░░░░░░░▀▀▀▀▀░▀░░░░░░░░░░
░░░░░░▄▄▄███░░░░░░░░░░░░░░░░░█▄░░░░░░░░░
▄▄▄█████████▀░░░░░░░░▄▄░░░░▄▄█████▄▄▄░░░
████████████░░░░░░░░░░██████████████████
█████████████░░░▀░░░░░▄█████████████████
██████████████░░░▄█▀▀█▀▀████████████████

''']

magas = [r'''
┼┼┼┼┼┼┼┼┼┼┼┼█████┼┼┼┼┼█████
┼┼┼┼┼┼┼┼┼┼┼┼┼▒▒▒┼┼┼┼┼┼┼▒▒▒
┼┼┼┼┼┼┼┼┼┼┼┼┼▒▒▒┼┼┼┼┼┼┼▒▒▒
┼┼┼┼┼┼┼┼┼┼┼┼░▒░▒░▒░▒░▒░▒░▒░
┼┼┼┼┼┼┼┼┼┼┼░▒░▒░▒░▒░▒░▒░▒░▒░
┼┼┼┼┼┼┼┼┼┼░▒░▒░▒░▒███▒░▒░▒░▒░
┼┼┼┼┼┼┼┼┼░▒░▒░▒░▒█████▒░▒░▒░▒░
┼┼┼┼┼┼┼┼░▒░▒░▒░▒░█░█░█░▒░▒░▒░▒░
┼┼┼┼┼┼┼░▒░▒░▒░▒░▒█████▒░▒░▒░▒░▒░
┼┼┼┼┼┼░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░
┼┼┼┼┼░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░▒░
┼┼┼┼┼┼┼▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
┼┼┼┼┼┼┼▒▒▒███▒▒▒▒▒███▒▒▒▒▒███▒▒▒
┼┼┼┼┼░┼░▒█░█░█▒▒▒█░█░█▒▒▒█░█░█▒▒
┼┼┼┼░░░░░█████▒▒▒█████▒▒▒█████▒▒
┼░░┼░░░░░█░█░█▒▒▒█░█░█▒▒▒█░█░█▒▒
░░░░░░░░▒█░█░█▒▒░░░░░░░▒▒█░█░█▒▒
░░░░░░░░▒░░███▒▒░█░█░█░▒▒█████▒▒
┼░░░░█░░░░░░▒▒▒▒░█░█░█░▒▒▒▒▒▒▒▒▒┼┼█
░█░░██░░░░░░▒▒▒▒░░░░░░░▒▒▒▒▒▒▒▒▒┼███
░██░██░█░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████
░░░█████░░░▒▒▒▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒┼░░░┼
░░░████░░░███▒▒▒░░█░█░░▒▒▒███▒▒▒┼░░░┼
┼░░███┼▒▒█░█░█▒░░██░██░░▒█░█░█▒▒┼░░░┼
┼┼░███┼▒▒█████▒░███░███░▒█████▒▒┼███┼
┼┼┼███┼▒▒█░█░█▒░███░███░▒█░█░█▒▒┼┼█┼┼
┼┼┼███┼▒▒█░█░█▒░███░███░▒█░█░█▒▒┼┼█┼┼
┼┼┼███┼▒▒█████▒░███░███░▒█████▒▒┼┼█┼┼
┼┼┼███┼▒▒▒▒▒▒▒▒░███░███░▒▒▒▒▒▒▒▒┼┼█┼┼
┼┼┼███┼▒▒▒▒▒▒▒▒░███░███░▒▒▒▒▒▒▒▒┼┼█┼┼
┼░████░▒▒▒▒▒▒▒▒░███░███░▒▒▒▒▒▒▒▒┼┼█┼┼
░░░┼░░░▒▒▒▒▒▒▒▒░███░███░▒▒▒▒▒▒▒▒┼┼█┼┼
░░░░░░░░┼░░░┼░░▒▒▒▒▒▒▒▒▒░░░░░░░░░███┼
┼░░░░┼░░░░░┼░░▒▒▒▒▒▒▒▒▒▒▒░░┼░░░░░███┼
░░░░░░░░┼░░░┼▒▒▒▒▒▒▒▒▒▒▒▒▒░░░░░░░███┼
░░░┼░░░░░░░░░░░┼░░░┼░░░░░░░░┼░░░░░░░░

''']

antena = [r'''
______________¶¶¶
_____________¶¶_¶¶¶¶
____________¶¶____¶¶¶
___________¶¶¶______¶¶
___________¶¶¶_______¶¶
__________¶¶¶¶________¶¶
__________¶_¶¶_________¶¶
__________¶__¶¶_________¶¶____¶¶
__________¶__¶¶__________¶¶¶¶¶¶¶
_________¶¶__¶¶¶______¶¶¶¶¶¶___¶
_________¶¶___¶¶__¶¶¶¶¶¶__¶¶
_______¶¶_¶____¶¶¶¶________¶¶
______¶¶__¶¶___¶¶__________¶¶
_____¶¶____¶¶___¶¶__________¶¶
___¶¶_______¶¶___¶¶_________¶¶
___¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶_________¶
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_¶¶________¶¶
¶¶__¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶______¶¶
¶¶¶¶¶___¶______¶___¶¶¶¶¶_____¶¶
________¶¶¶¶¶¶¶¶______¶¶¶¶¶_¶¶
______¶¶¶¶¶¶¶¶¶¶¶________¶¶¶¶
______¶¶¶¶¶¶¶¶¶¶¶¶
______¶__¶¶_¶¶¶¶¶¶
_____¶¶______¶___¶
_____¶¶_____¶¶___¶
_____¶______¶¶___¶
____¶¶______¶¶___¶¶
____¶¶______¶¶___¶¶
___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
__¶¶¶¶¶¶¶¶¶_¶¶¶¶¶¶¶¶
__¶¶________¶¶¶____¶¶
____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶

''']

print (r"""

\\\\\\\\\\\\\\\\\\\\_____________Добро пожаловать_____________////////////////////""")

(r'''lol = subprocess.call(r'Users\LoL\Desktop\doom.bat')''')                                                      
                                                                                                    

print(r"""В этой игре вам придется пройти свой жизненый путь От Бомжа с 200р до Милонера. Но не думайте что это будет просто.
Вас будут ждать много сложностей на пути к совим мелионам. Вас могут убить или збить машина.""")

name = input("Введите ваше имя - ")

input('\n\nНажмите ENTER, чтобы продолжить')
print(p*50)
while True:
    if 24 < Time :
        day += 1
        Time -= 24
    print ('День', day)
    if (Time > 5) & (Time <= 10):
        print('Время', Time,'Утра')
    elif (Time > 10) & (Time <= 18):
        print('Время', Time,'День')
    elif (Time > 18) & (Time <= 21):
        print('Время',Time,'Вечера')
    elif (Time > 21) & (Time >= 0) & (Time <= 5):
        print('Время',Time,'Ночи')
    print('Ваши статы:')
    print('Ваше имя =', name)
    print('Здоровье = ',live)
    print('Уровень = ',lavl)
    print('Жилье = ',hostal)
    print('Машина = ',car)
    print('Сытость = ', eat)
    print('Сон = ',sleep)
    print('Деньги = ', money,' руб')
    print(p*3)
    ############################################### Проверки
    if sleep <= 0 :
        live -= 12
        print ('Надо поспать!!')
    
    if live <= 0 :
        print ('Вы умерли')
        break

    if money >= 15000000 :
        print ('Поздравляем вы выиграли!!')
        input('\n\nНажмите ENTER, если хотите начать все занова\n')
        if ('yes') and ('y') and ('да') and ('+'):
            input('\n\nНажмите ENTER, вы действительно хотте начать все с начала\n') 
            money = 200
            hostal = 'Бездомный'
            car = 'Велосипед'
        if ('no') and ('n') and ('нет') and ('-'):
            input('\n\nНажмите ENTER, вы действительно хотте выйти\n')
            break

    print('''
    Выберите действие:
    1. Покушать
    2. Расслабиться
    3. Работа (Низкий уровень)
    4. Работа (Средний уровень)
    5. Работа (Премиум уровень)
    5.2. Подзаработать
    5.3 Олата недвижемости
    6. Магазин
    7. Автосалон
    8. Выход''')
    go = input('\nЧто делаем?\n(Введите число или слово)\n ')


    if (go.lower() == '1') | (go.lower() == 'покушать'):
        kost = 0
        print('вы заглядываете в холодильник, там:')
        if holodos == [] :
                print('*ПУСТО*')
        else: ###Выводит что в ходолосе
            for i in holodos :
                if i[0] == 'Кофе' :
                    print(kost + 1,'. ', i[0],', даёт бодрости - ', i[3])
                elif  i[0] == 'Чай' :
                    print(kost + 1,'. ', i[0],', Прибовляет желания жить - ', i[3])
                else:
                    print(kost + 1,'. ', i[0],', даёт сытости - ', i[3])
                kost += 1
        perehod = input('выберите, "кушать" или идити в "магазин"\n')
        if perehod.lower() == 'кушать' :
            perehod = input('Введите номер продукта:')
            try:
                perehod = (int(perehod)-1)
                if (kost <= (perehod)) | (perehod <= -1)  :
                    print('Введено неверное значение')
                elif holodos[perehod][0] == 'Кофе' :
                    print(r''' 

───────────▒▒▒▒▒▒▒▒
─────────▒▒▒──────▒▒▒
────────▒▒───▒▒▒▒──▒░▒
───────▒▒───▒▒──▒▒──▒░▒
──────▒▒░▒──────▒▒──▒░▒
───────▒▒░▒────▒▒──▒░▒
─────────▒▒▒▒▒▒▒───▒▒
─────────────────▒▒▒
─────▒▒▒▒────────▒▒
───▒▒▒░░▒▒▒─────▒▒──▓▓▓▓▓▓▓▓
──▒▒─────▒▒▒────▒▒▓▓▓▓▓░░░░░▓▓──▓▓▓▓
─▒───▒▒────▒▒─▓▓▒░░░░░░░░░█▓▒▓▓▓▓░░▓▓▓
▒▒──▒─▒▒───▓▒▒░░▒░░░░░████▓▓▒▒▓░░░░░░▓▓
░▒▒───▒──▓▓▓░▒░░░░░░█████▓▓▒▒▒▒▓▓▓▓▓░░▓▓
──▒▒▒▒──▓▓░░░░░░███████▓▓▓▒▒▒▒▒▓───▓▓░▓▓
──────▓▓░░░░░░███████▓▓▓▒▒▒▒▒▒▒▓───▓░░▓▓
─────▓▓░░░░░███████▓▓▓▒▒▒▒▒▒▒▒▒▓▓▓▓░░▓▓
────▓▓░░░░██████▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▓░░░░▓▓
────▓▓▓░████▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓
─────▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓
─────▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓
──────▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓
───────▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓
─────────▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓
───────────▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓
───────────────▓▓▓▓▓▓▓▓
''')
                    sleep += int(holodos[perehod][3])
                    happy += 10
                    if (Time >= 9) and (Time < 21): ###Если день
                        Time += 2
                    else: ###Если ночь
                        Time += 3
                    del holodos[perehod]
                elif holodos[perehod][0] == 'Чай' :
                    print(r'''__________________________________________________
__________________________________________________
_________________________¶¶¶¶_____________________
_______________________¶¶¶¶¶¶¶¶___________________
____________________¶¶¶¶¶¶¶¶¶¶¶¶__________________
___________________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶________________
________________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____________
_¶¶¶¶¶________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶___¶¶¶¶¶¶___
__¶¶¶¶¶______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶_
___¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶¶¶______¶¶¶
____¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶_______¶¶¶
____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶¶______¶¶¶
____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶¶______¶¶¶
_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶¶_____¶¶¶_
______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶¶____¶¶¶¶__
_______¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶¶__¶¶¶¶____
________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶______
__________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_________
______________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____________
__________________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶________________
__________________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶________________
 ''')
                    happy += (int(holodos[perehod][3]) + 10)
                    sleep += 5
                    if (Time >= 9) and (Time < 21): ###Если день
                        Time += 2
                    else: ###Если ночь
                        Time += 3
                    del holodos[perehod]
                else:
                    sleep -= 15
                    eat += int(holodos[perehod][3])
                    happy += 10
                    if (Time >= 9) and (Time < 21): ###Если день
                        Time += 2
                    else: ###Если ночь
                        Time += 3
                    del holodos[perehod]
            except ValueError:
                print('Это не число!')
            input('Нажмите ENTER, чтобы продолжить')
            print(p*50)
        elif perehod.lower() == 'магазин' :
            perehod = random.randint(1,4)
            if perehod == 3 :
                print(r"""
                ./\…/\
                (‘•..•’)
                ..=*=..
                (.\.||./.)~~**""",'\n')
                print('Вы заметили кошку.... Поймать?')
                perehod = input('(Да или Нет)  ')
                if perehod.lower() == 'да' :
                    perehod = random.randint(1,2)
                    if perehod == 1 :
                        print('\nКошка убежала')
                    if  perehod == 2 :
                        print('Вы поймали кошку, что будете с ней делать?')
                        print(r'''
____________________________________$$$$
__________________________________$$____$
_________________________________$_______$
___$$$$_________________________$_________$
__$____$$______________________$____$_____$
_$_______$$___________________$____$$$____$
_$_________$$_____$$$$_$$$___$____$$$$$___$
$____________$_$$$__$$$__$$_$____$$$$$$___$
$____$$_______$_$$__$$$__$$$____$$$$$$$___$
$___$$$$_______$$$$_$$$___$$_____$$$$$$___$
$___$$$$$$_____$$$$_$$$$__$$$______$$$$$__$
$___$$$$$$$____$$$$_$$$$__$$$________$$$__$
$___$$$$$______$$$$_$$$$__$$$$____________$
$___$$$$_______$$$$_$$$$__$$$$____________$
$___$$$________$$$$_$$$$__$$$$____________$
$___$$_________$$$$__$$$__$$$$____________$
$______________$$$___$$$___$$$____________$
$_______________$_____$_____$_____________$
_$_________________________________________$
$________________________________$$$$_______$
$_______________________________$__$$$______$
$__________$$$$________________$$__$$$$_____$
$_________$$$__$_______________$$$$$$$$_____$
$________$$$$__$_______________$$$$$$$$_____$
$________$$$$$$$$______________$$$$$$$$_____$
$________$$$$$$$$_______________$$$$$$______$
$________$$$$$$$$_______$___$____$$$$_______$
$_________$$$$$$_____$__$$_$________________$
$__________$$$$_______$$__$________________$
_$_____________________$__$_______________$
__$_____________________$$_______________$
___$______________________________$$$___$
____$$___________________________$___$_$
______$$$_______________________$_____$
_________$$$$_____________$$$$$$______$
___$$________$$$$$$$$$$$$$____________$
__$__$________$___$_________________$$
__$___$_______$____$_____________$$$
__$___$________$____$___________$$
__$$$$$$_______$____$__________$__$
___$___$$_______$___$_________$____$
___$$$$$$$___$$$_$$$_________$_____$
____$___$$$$$__$_____$_______$_____$
_____$__$______$_____$_______$_____$
______$$$$$$$$$$_____$_______$____$
________________$$$$$_________$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
''')
                        perehod = input('Погладить/Cъесть   ')
                        if perehod.lower() == 'погладить' :
                            happy += 50
                            print(r""" 
                            ...................../\____/\
                            ....................|   _  _| 
                            .................../`   __x_/ мур
                            ................./         |
                            .............../   \      /
                            ........... ___│    |  |  |
                            ........../   _|    |  |  |
                            ..........|  (__\___\_)\__)
                            ...........\ __) """)
                            print('Желание жить = ',happy)
                        elif perehod.lower() == 'съесть':
                            print(r'''
________                       __     ._.
\______ \  __ ______________  |  | __ | |
 |    |  \|  |  \_  __ \__  \ |  |/ / | |
 |    `   \  |  /|  | \// __ \|    <   \|
/_______  /____/ |__|  (____  /__|_ \  __
        \/                  \/     \/  \/
 
 ───▄▄─▄████▄▐▄▄▄▌
──▐──████▀███▄█▄▌
▐─▌──█▀▌──▐▀▌▀█▀
─▀───▌─▌──▐─▌
─────█─█──▐▌█
''')
                            live -= 20
                            happy -= 20
                            print(p*4)
                            print(r'''
───────█────────────────────────███▓
────█──██──────────────────────███▓
─────██████───────────────────███▓
──────███████────────────────███▓
───── █◉██████───────────────██▓
────██████████───────────────██▓
────██████████────────────────██▓
─────█████████──────────█████████
─────────██████─────██████████████
─────────██████████████████████████
─────────██████████████████████████
─────────██████████████████████████
─────────██████████████████████████
──────────████████████▓▓▓▓█████████
──────────███████▓▓▓▓▓────▓████████
─────────█████▓▓▓──────────▓████████
─────────███▓▓██────────────▓▓██████
────────███▓─███─────────────█▓▓▓████
────────███──███─────────────███──███
───────███────██─────────────███───██
───────██─────███────────────██────██
──────███──────██───────────███────██
─────███───────██───────────██─────██
─────██─────────██─────────██──────██
────███─────────██────────███──────██
─彡███────────彡███──────彡███────彡███
''')
                            print('Кошка поцарапала вас и убежала: Здоровье = ', live,'; Счастье = ', happy)
                elif perehod.lower() == 'нет' :
                    print('Вы решили не ловить кошку и пошли дальше\n')
            print('Вы пришли в магазин, что хотите купить?')
            kost = 0
            for i in magaz : ### Выводит магазин
                if holodos == () :
                   print('*ПУСТО*')
                elif i[0] == 'Кофе' :
                    print(kost + 1,'. ', i[0], '- стоит',i[1],i[2],', даёт бодрости - ', i[3])
                elif  i[0] == 'Чай' :
                    print(kost + 1,'. ', i[0], '- стоит',i[1],i[2],', прибавляет желания жить - ', i[3])
                else:
                    print(kost + 1,'. ', i[0], '- стоит',i[1],i[2],', даёт сытости - ',i[3])
                kost += 1
            kost = input('сколько продукктов вы хотите купить?') 
            if (kost == '') :
                print('Введено неверное значение')
                input('Нажмите ENTER чтобы вернуться')
                print(p*100)
                kost = 0
            try:
                kost = int(kost)
                if (kost <= 0) : 
                    print('Введено неверное значение')
                    input('Нажмите ENTER чтобы вернуться')
                    print(p*100)
                if (kost > 0) & (Time >= 9) & (Time < 21) : ###Если день
                    Time += 2
                elif (kost > 0): ###Если ночь
                    Time += 3
                while kost > 0: ### Прцесс покупки
                    perehod = int(input('Введите номер продукта(ЧИСЛО!!!!):'))-1
                    if (perehod < 0) | (perehod > 12) :
                        print('Такого продукта нет')
                    elif (money - int(magaz[perehod][1])) >= 0 :
                        holodos.append(magaz[perehod])
                        money-= int(magaz[perehod][1])
                        print('у вас осталось =',money,'руб.')
                        kost -= 1
                    else:
                        print('Недостаточно средств!')
                        kost -= 1
            except ValueError:
                print('Это не число!')
                input('Нажмите ENTER чтобы вернуться')
                print(p*100)
        else:
            print('Вы ввели не правильное сообщение')
            input('Нажмите ENTER чтобы вернуться')
            print(p*50)


    if (go.lower() == '2') | (go.lower() == 'Расслабиться'):
        print(r"""
            1.Поиграть в футбол
            2.Пойти в бар
            3.Пойти в ночной клуб
            4.Посмотреть телевизор
            5.Поспать
        """)
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 5 :
                print('Введено неправлельное значение')
        except ValueError:
                print('Введено неправлельное значение')
        if perehod == '1' :
            if (Time >= 9) and (Time < 21): ###Если день
                sleep -= 10
                eat -= 10
                happy += 30
                Time += 2
            else: ###Если ночь
                sleep -= 20
                eat -= 10
                happy += 20
                Time += 3
        elif perehod.lower() == '2' :
            if (Time >= 9) and (Time < 21): ###Если день
                sleep -= 30
                eat += 20
                happy  += 10
                Time += 6
            else: ###Если ночь
                sleep -= 50
                eat += 10
                happy  += 20
                Time += 3
        elif perehod.lower() == '3' :
            if (Time >= 9) and (Time < 21): ###Если день
                sleep -= 10
                eat -= 30
                happy += 89
                Time += 5
            else: ###Если ночь
                sleep -= 30
                eat += 30
                happy  += 99
                Time += 9
        elif perehod.lower() == '4' :
            if (Time >= 9) and (Time < 21): ###Если день
                sleep -= 30
                eat += 20
                happy  += 10
                Time += 6
            else: ###Если ночь
                sleep -= 10
                eat += 10
                happy  += 20
                Time += 3
        elif perehod.lower() == '5' :
            if sleep < 70 :
                if (Time >= 9) and (Time < 21): ###Если день
                    sleep = 100
                    live = 100
                    eat = 20
                    Time += 2
                elif (Time >= 21) | ((Time >= 0 ) & (Time < 6)): ###Если ночь
                    sleep = 100
                    live = 100
                    eat = 15
                    Time += 6
                elif Time == 6 :
                    sleep = 70
                    live = 100
                    eat = 5
                    Time += 3
            else:
                print('Вы достаточно поспали')
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)


    if (go.lower() == '3') | (go.lower() == 'Работа (Низкий уровень)'): ####Низкий класс
        if lavl >= 1 :
            print ('Работа доступна!!')
        os.system(r"BomshCod\McDonalds-19.jpg")
        print(r'''
            1.Уборщик в Макдольносе - 50/руб 5 час
            2.Касир в Макдольносе - 100/руб 8 час
            3.Курер - 150/руб 8 час
            4.Зам начальника Макдольнуса - 500/руб 8 час
            5.Начальник Магдольнуса - 1000/руб 9 час
        ''')
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 5 :
                print('Введено неправлельное значение')
        except ValueError:
                print('Введено неправлельное значение')
        if perehod == '1' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 3
                eat -= 3
                Time += 5
                money += 50
                print('Ваши сбережения =',money)
            else:
                print('Ккакой Магдольнус ночью!?')
        print(mass[0])
        if perehod == '2' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 4
                eat -= 5
                Time += 8
                money += 100
                print('Ваши сбережения =',money)
            else:
                print('Кокой Могдольнус ночью!?')
            print(mass[0])
        if perehod == '3' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 8
                eat -= 7
                Time += 8
                money += 150
                print('Ваши сбережения =',money)
            else:
                print('Кокой Могдольнус ночью!?')
            print(mass[0])
        if perehod == '4' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 10
                eat -= 10
                Time += 8
                money += 500
                print('Ваши сбережения =',money)
            else:
                print('Кокой Могдольнус ночью!?')
            print(mass[0])
        if perehod == '5' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 15
                eat -= 15
                Time += 9
                money += 1000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Могдольнус ночью!?')
            print(mass[0])
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)

    if (go.lower() == '4') | (go.lower() == 'Работа (Средний уровень)'): ####Средний класс
        if lavl == 2 :
            print ('Работа доступна')
            os.system(r"BomshCod\1602833336_24-p-dizain-ofisnikh-pomeshchenii-30.jpg")
            print(r'''
                1.Уборщик кабинотов в офисе - 30.000/руб 8 час
                2.Помошник помошника по бугалтерии - 35,000/руб 8 час
                3.Младший бугалтер - 39.000/руб 8час 
                4.Редовой бугалтер - 40.000/руб 8 час
                5.Главный бугалтер - 43.000/руб 8 час
                6.Зам. Деректора - 50.000/руб 8 час
                7.Деректор отдела бугалтерии - 70.000/руб 8 час
            ''')
            perehod = input('Выберите действие(НОМЕР!!!):\n')
            try:
                if (perehod == '') :
                    print('Введено неправлельное значение')
                elif int(perehod) > 7 :
                    print('Введено неправлельное значение')
            except ValueError:
                    print('Введено неправлельное значение')
            if perehod == '1' :
                if (Time >= 9) and (Time <= 17): ###Если день
                        sleep -= 20
                        eat -= 20
                        Time += 8
                        money += 30000
                        print('Ваши сбережения =',money)
                else:
                    print('Ккакой Офис ночью!?')
                print(mass[0])
            if perehod == '2' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 20
                    eat -= 30
                    Time += 8
                    money += 35000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            if perehod == '3' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 30
                    eat -= 30
                    Time += 8
                    money += 39000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            if perehod == '4' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 30
                    eat -= 30
                    Time += 8
                    money += 40000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            if perehod == '5' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 30
                    eat -= 30
                    Time += 8
                    money += 43000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            if perehod == '6' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 40
                    eat -= 40
                    Time += 8
                    money += 50000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            if perehod == '7' :
                if (Time >= 9) and (Time <= 17): ###Если день
                    sleep -= 50
                    eat -= 30
                    Time += 8
                    money += 70000
                    print('Ваши сбережения =',money)
                else:
                    print('Кокой Офис ночью!?')
                print(mass[0])
            input('\n\nНажмите ENTER, чтобы продолжить')
            print(p*50)
        elif lavl <= 1 :
            print ('Работа не доступна!!')
            input('\n\nНажмите ENTER, чтобы продолжить')
            print(p*50)

    if (go.lower() == '5') | (go.lower() == 'Работа (Премиум уровень)'): ####Премиум класс
        if lavl < 2 :
            print ('Работа не доступна!!')
        if lavl >= 3 :
            print ('Работа доступна')

        os.system(r"BomshCod\Government_RF.jpg")
        print(r'''
            1.Зам. Губернатора Города - 100.000/руб 9 час
            2.Губернатор города - 200.000/руб 9 час
            3.Зам. Губернатора области - 300.000/руб 9 час 
            4.Губернатора области - 400.000/руб 9 час
            5.Зам. Помошнка призидента - 500.000/руб 9 час
            6.Помошнка призидента - 550.000/руб 10 час
            7.Призидент - 800.000/руб 10 час
        ''')
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 7 :
                print('Введено неправлельное значение')
        except ValueError:
                print('Введено неправлельное значение')
        if perehod == '1' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 60
                eat -= 30
                Time += 9
                money += 100000
                print('Ваши сбережения =',money)
            else:
                print('Какая работа ночью!?')
        print(mass[0])
        if perehod == '2' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 70
                eat -= 30
                Time += 9
                money += 200000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        if perehod == '3' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 75
                eat -= 45
                Time += 9
                money += 300000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        if perehod == '4' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 75
                eat -= 45
                Time += 9
                money += 400000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        if perehod == '5' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 80
                eat -= 45
                Time += 9
                money += 500000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        if perehod == '6' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 80
                eat -= 45
                Time += 10
                money += 550000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        if perehod == '7' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 100
                eat -= 55
                Time += 10
                money += 800000
                print('Ваши сбережения =',money)
            else:
                print('Кокой Офис ночью!?')
            print(mass[0])
        input('\n\nНажмите ENTER, чтобы выйти с работы')
        print(p*50)

    if (go.lower() == '5.2') | (go.lower() == 'Подзаработать'):
        print(r''' Деньги лишними не бывают
──────────────────██████────────────────
─────────────────████████─█─────────────
─────────────██████████████─────────────
─────────────█████████████──────────────
──────────────███████████───────────────
───────────────██████████───────────────
────────────────████████────────────────
────────────────▐██████─────────────────
────────────────▐██████─────────────────
──────────────── ▌─────▌────────────────
────────────────███─█████───────────────
────────────████████████████────────────
──────────████████████████████──────────
────────████████████─────███████────────
──────███████████─────────███████───────
─────████████████───██─███████████──────
────██████████████──────────████████────
───████████████████─────█───█████████───
──█████████████████████─██───█████████──
──█████████████████████──██──██████████─
─███████████████████████─██───██████████
████████████████████████──────██████████
███████████████████──────────███████████
─██████████████████───────██████████████
─███████████████████████──█████████████─
──█████████████████████████████████████─
───██████████████████████████████████───
───────██████████████████████████████───
───────██████████████████████████───────
─────────────███████████████────────────

        Выберите действие:
        1.Игра на бирже   Заработок зависит от удачи
        2.Игра в кости    Ставки: 50$,100$,300$,500$,1000$
        3.Кодить          зарплата от 10$ до 300$
        ''')
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неверное значение')
            elif int(perehod) > 3 :
                print('Введено неверное значение')
        except ValueError:
            print('Введено неверное значение')
        if perehod == '1' :
            if (Time >= 9) and (Time <= 17): ###Если день
                sleep -= 40
                eat -= 0
                Time += 4
                money.appendet(random.randomet(800,5000))
                print('Ваши сбережения =',money)
            else:
                print('Какая Биржа ночью!?')
            print(mass[0])
        if perehod == '2' :
            kost = random.randint(1,1000)
            if kost == 1 :
                if (Time >= 9) and (Time < 21): ###Если день
                    sleep -= 15
                    eat -= 0
                    Time += 2
                    money += 0
                else: ###Если ночь
                    eat -= 0
                    happy -= 15
                    Time += 3
                    money.appendet(random.randint(50,1000))
                print(r'''
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
░░░░░░░░░░▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄░░░░░░░░░
░░░░░░░░▄▀░░░░░░░░░░░░▄░░░░░░░▀▄░░░░░░░
░░░░░░░░█░░▄░░░░▄░░░░░░░░░░░░░░█░░░░░░░
░░░░░░░░█░░░░░░░░░░░░▄█▄▄░░▄░░░█░▄▄▄░░░
░▄▄▄▄▄░░█░░░░░░▀░░░░▀█░░▀▄░░░░░█▀▀░██░░
░██▄▀██▄█░░░▄░░░░░░░██░░░░▀▀▀▀▀░░░░██░░
░░▀██▄▀██░░░░░░░░▀░██▀░░░░░░░░░░░░░▀██░
░░░░▀████░▀░░░░▄░░░██░░░▄█░░░░▄░▄█░░██░
░░░░░░░▀█░░░░▄░░░░░██░░░░▄░░░▄░░▄░░░██░
░░░░░░░▄█▄░░░░░░░░░░░▀▄░░▀▀▀▀▀▀▀▀░░▄▀░░
░░░░░░█▀▀█████████▀▀▀▀████████████▀░░░░
░░░░░░████▀░░███▀░░░░░░▀███░░▀██▀░░░░░░
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
''')
                print('Ваши сбережения =',money)
            else:
                print('Не повезло, работы пока нет')
                if (Time >= 9) and (Time < 21): ###Если день
                    Time += 2
                    sleep -= 5
                    eat -= 15
                else: ###Если ночь
                    Time += 3
                    sleep -= 25
                    eat -= 15
                    happy -= 10
                print(antena[0])
                print('Ваши сбережения =',money)
        if perehod == '3' :
            kost = random.randint(1,300)
            if kost == 1 :
                if (Time >= 9) and (Time < 21): ###Если день
                    sleep -= 20
                    eat -= 20
                    Time += 2
                    money += 300
                else: ###Если ночь
                    eat -= 20
                    Time += 3
                    money += 100
                print(r'''
─────▄▄────▄▀▀█▀▀▀▀▄
──▄▀▀──▀▀▄▄█▄▄█────█
▄▀─────────█──█────█
────────────▀▀▀▀▀▀▀
''')
                print('Ваши сбережения =',money)
            else:
                print('Не повезло, работы пока нет')
                if (Time >= 9) and (Time < 21): ###Если день
                    Time += 2
                    sleep -= 0
                    eat -= 0
                else: ###Если ночь
                    Time += 3
                    sleep -= 0
                    eat -= 0
                print(antena[0])
                print('Ваши сбережения =',money)
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)

 ########################################################################################################################

    if (go.lower() == '5.3') | (go.lower() == 'Оплата недвижемости'):  ##Оплата недвижемости в день
        print(r'''
            1.Оплата общежтия
            2.Оплата маленькой квортиры
            3.Оплата комнаты
        ''')
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 7 :
                print('Введено неправлельное значение')
        except ValueError:
            print('Введено неправлельное значение')

        if   perehod == '1' :
            go = input('\nЧто делаем?\n(Платим за Общежитие или нет?)\n') ### Общежитие
            if (go == ("not") and ("n") and ("нет") and ('-')):
                input('Нажмите ENTER чтобы подтвердить действие')
                hostal = ''
                print ('Вас выгнали')
            if (go == ('yes') and ('y') and ('да') and ('+')):
                input('Нажмите ENTER чтобы подтвердить действие')
                money -= 200
                hostal = 'Общежитие'

        if   perehod == '2' :
            go = input('\nЧто делаем?\n(Платим за Сем маленькой квартиры или нет?)\n') ### Сем маленькой квартиры
            if (go == ("not") and ("n") and ("нет") and ('-')):
                input('Нажмите ENTER чтобы подтвердить действие')
                hostal = ''
                print ('Вас выгнали')
            if (go == ('yes') and ('y') and ('да') and ('+')):
                input('Нажмите ENTER чтобы подтвердить действие')
                money -= 2000
                hostal = 'Маленькая квартира'

        if   perehod == '3' :
            go = input('\nЧто делаем?\n(Платим за Сем комнаты или нет?)\n') ### Сем комнаты
            if (go == ("not") and ("n") and ("нет") and ('-')):
                input('Нажмите ENTER чтобы подтвердить действие')
                hostal = ''
                print ('Вас выгнали')
            if (go == ('yes') and ('y') and ('да') and ('+')):
                input('Нажмите ENTER чтобы подтвердить действие')
                money -= 4000
                hostal = 'Сем комнаты'
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)

 ##################################################################################################

    if (go.lower() == '6') | (go.lower() == 'Магазин'):
        print(magas[0])
        print(r'''
            1.Общежите (Стоимость:200 в день)
            2.Съём маленькой комнатки (Стоимость:2000 в день)
            3.Съём комнаты (Стоимость:4000 в день)
            4.Своя квартира (Стомость:92k)
            5.Загородный дом (Стоимость:120K)
            6.Пенхаус у моря (Стоимость:500k)
            7.Частный остров (Стоимость:1kk)
        ''')
        perehod = input('Выберите действие(НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 7 :
                print('Введено неправлельное значение')
        except ValueError:
            print('Введено неправлельное значение')

        if perehod == '1' : #### Заселение в Общежитие
            os.system(r"BomshCod\image_968_800_800_.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Общежитие или нет?)\n') ### Общежитие
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 200
                hostal += 'Общежитие'

        if perehod == '2' : #### Заселение в Маленькую квартиру
            os.system(r"BomshCod\29-New-Desain-Kamar-Tidur-Sempit-Tanpa-Jendela-Paling-Banyak-di-Cari.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Маленькую квартиру или нет?)\n') ### Маленькая квартира
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 2000
                hostal += 'Маленькая квартира'
            
        if perehod == '3' : #### Заселение в Сем комнаты
            os.system(r"BomshCod\134.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Сем комнаты или нет?)\n') ### Сем комнаты
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 4000
                hostal += 'Сем комнаты'

        if perehod == '4' : #### Заселение в Свою квартиру
            os.system(r"BomshCod\dizajn-komnata-stil-stul-salon-kvartira.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Свою квартиру или нет?)\n') ### Свая квартира`
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 92000
                hostal += 'Свая квартира'

        if perehod == '5' : #### Заселение в Загородный дом
            os.system(r"BomshCod\157.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Загородный дом или нет?)\n') ### Загородный дом
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 120000
                hostal += 'Загородный дом'

        if perehod == '6' : #### Заселение в Пенхаус у моря
            os.system(r"BomshCod\scale_1200.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Пенхаус у моря или нет?)\n') ### Пенхаус у моря
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 500000
                hostal += 'Пенхаус у моря'

        if perehod == '7' : #### Заселение в Частный остров
            os.system(r"BomshCod\44cc381f811c8a1cc74191afef7db5fa.jpg") 
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Заселяемя в Частный остров или нет?)\n') ### Частный остров
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                hostal = ''
                money -= 1000000
                hostal += 'Частный остров'
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)

 ########################################################################################################

    if (go.lower() == '7') | (go.lower() == 'Автосалон'):
        os.system(r"BomshCod\bentley_car_showroom.jpg")
        print(r'''
            1. Разбитый пикап (Стоимость: 10.000)
            2. Машина из 90-х (Стоимость: 15.000)
            3. Машина среднего класса (Стоимость: 30.000)
            4. Джип: Лексус (Стоимость: 100.000)
            5. Джип: БМВ Х8 90 (Стоимость: 150.000)
            6. Шеврале (Стоимость: 230.000)
            7. Урас (Стоимость: 999.999)
            8. Ламбарджини Хурасан (Стоимость:12.000.000)
        ''')
        perehod = input('Выберите машину (НОМЕР!!!):\n')
        try:
            if (perehod == '') :
                print('Введено неправлельное значение')
            elif int(perehod) > 8 :
                print('Введено неправлельное значение')
        except ValueError:
            print('Введено неправлельное значение')

        if perehod == '1' :
            os.system(r"BomshCod\Разбитый_пкап.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Разбитый джип или нет?)\n') ### Разбитый пикап
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 10000
                car += 'Разбитый пикап'

        if perehod == '2' :
            os.system(r"BomshCod\Машина_из_90-х.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Машина из 90-х или нет?)\n') ### Машина из 90-х
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 15000
                car += 'Машина из 90-х'

        if perehod == '3' :
            os.system(r"BomshCod\Машина_среднего_класса.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Машина среднего класса или нет?)\n') ### Машина среднего класса
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 30000
                car += 'Машина среднего класса'

        if perehod == '4' :
            os.system(r"BomshCod\Джип_Лексус.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Джип: Лексус или нет?)\n') ### Джип: Лексус
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 100000
                car += 'Джип: Лексус'

        if perehod == '5' :
            os.system(r"BomshCod\Машина_из_90-х.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Джип: БМВ Х8 90 или нет?)\n') ### Джип: БМВ Х8 90
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 150000
                car += 'Джип: БМВ Х8 90'

        if perehod == '6' :
            os.system(r"BomshCod\Шеврале.jpeg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Шеврале или нет?)\n') ### Шеврале
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 230000
                car += 'Шеврале'

        if perehod == '7' :
            os.system(r"BomshCod\Урас.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Урас или нет?)\n') ### Урас
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 999999
                car += 'Урас'

        if perehod == '8' :
            os.system(r"BomshCod\Ламбарджини Хурасан.jpg")
            Vibor = True
            Vibor = False 
            input('\nЧто делаем?\n(Покупаем Ламбарджини Хурасан или нет?)\n') ### Ламбарджини Хурасан
            if ('yes') and ('y') and ('да') and ('+'):
                input('Нажмите ENTER чтобы подтвердить действие\n')
                car = ''
                money -= 12000000
                car += 'Ламбарджини Хурасан'
        input('\n\nНажмите ENTER, чтобы продолжить')
        print(p*50)

 ###################################################################################

    if (money <= 30000): ###Низкий класс
        lavl=[1]
    elif (money > 30000):
        lavl=[0]

    if (money <= 80000): ###Средний класс
        lavl=[2]
    elif (money > 80000):
        lavl=[1]

    if money <= 1000000: ###Премиум класс
        lavl=[3]
    elif money > 1000000:
        lavl=[2]

 ########################################################################################

    if (go.lower() == '8') | (go.lower() == 'Выход'):
        input('Вы уверны что хотите выйти:\n')
        break
